OlegDemk/stm32F401CCU_NTF24L01_RX_TX_Sleep/1. TX/Core/Src/main.c
}
// End BME280 part/////////////////////////////////////////////////////////////////////////////////////
// --------------------------------------------------------------------------------
void meassure_battery_voltage(char * buff)
{
	uint16_t i = 0;
	char str[35]={0};

	HAL_ADC_Start(&hadc1);
	HAL_ADC_PollForConversion(&hadc1, 100);
//		i = (uint32_t)HAL_ADC_GetValue(&hadc1);
	HAL_ADC_Stop(&hadc1);

	float V_bat = (float)HAL_ADC_GetValue(&hadc1)*3.3/4096;

	char buffer[10] = {0,};
	float battery_voltage = 0;

	memset(buffer, 0, sizeof(buffer));
	sprintf(buffer, "V%.1f ", V_bat);
	strcat(buff, buffer);
}
// --------------------------------------------------------------------------------
void led_test_blink(uint16_t times, uint16_t delay)
{
	for(int i = 0; i <= times; i++)
	{
		RED_LED_ON;
		GREEN_LED_ON;
		HAL_Delay(delay);
		RED_LED_OFF;
		GREEN_LED_OFF;
		HAL_Delay(delay);
	}
}
// --------------------------------------------------------------------------------------
void error_blink_red_led(void)
{
	while(1)
	{
		RED_LED_TOGLE;
		HAL_Delay(100);
	}
}
// --------------------------------------------------------------------------------------
void read_time(char * buff)
{

	time_i2c_write_single(DS3231_I2C_ADDRESS, 0x0E, 0x04);			// Turn Off square wave signal on SQW Pin DS3231
	time_i2c_write_single(DS3231_I2C_ADDRESS, 0x0F, 0x00);			// Turn Off square wave signal on 32K Pin DS3231

	uint8_t buffer = 0;
	uint8_t time_ds3231[10] = {0,};

	for(int i = 0; i <=8; i++)
	{
		ds3231_read(i, &buffer);
		time_ds3231[i] = buffer;
	}

	// convert time into string
	char buf_1[5] = {0,};

	for(int i = 2; i >= 0 ; i--)	 // Зчитати ще день, мі�?�?ць і рік !!!!!!
	{
		sprintf(buf_1, "%d", time_ds3231[i]);
		strcat(buff, buf_1);
		memset(buf_1, 0, sizeof(buf_1));

		if(i > 0)
		{
			strcat(buff, ":");
		}
	}
	strcat(buff, " ");
}
// --------------------------------------------------------------------------------------
void read_time_internal_RTC(char *buff)
{
	 RTC_TimeTypeDef sTime;
	 RTC_DateTypeDef sDate;

	 HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	 HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);


	 char buf_uart_tx[70] = {0,};
	 sprintf(buf_uart_tx, "%d:%d:%d %d.%d.%d ", sTime.Hours, sTime.Minutes, sTime.Seconds, sDate.Date, sDate.Month, sDate.Year);
	 strcat(buff, buf_uart_tx);

#if UART_LOG == ON
	 HAL_UART_Transmit(&huart1, buf_uart_tx, sizeof(buf_uart_tx), 1000);
#endif
}
// -----------------------------------------------------------------------------------------------
void set_time_internal_RTC(void)
{
	RTC_TimeTypeDef sTime;
	RTC_DateTypeDef sDate;

	sTime.Hours = 0x0B;				// 11
	sTime.Minutes = 0x0C;			// 12
	sTime.Seconds = 0x0D;			// 13
	sTime.DayLightSaving = RTC_DAYLIGHTSAVING_NONE;
	sTime.StoreOperation = RTC_STOREOPERATION_RESET;
	if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}

	sDate.WeekDay = RTC_WEEKDAY_MONDAY;
	sDate.Month = RTC_MONTH_JANUARY;
	sDate.Date = 0x1;
	sDate.Year = 0x18;

	if (HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BCD) != HAL_OK)
	{
		Error_Handler();
	}
}
// --------------------------------------------------------------------------------------
void settings_mode(void)
{


}
// --------------------------------------------------------------------------------------


#define COUNTER_PACKET 1
#define COUNTER_RETRANSMITED_PACKET 2
#define COUNTER_LOST_PACKET 3
#define COUNTER_SECOND 4

void WriteBackupRegister(uint32_t data, uint8_t type)
{
	if(type == COUNTER_PACKET)
	{
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR1, data);
	}
	if(type == COUNTER_SECOND)
	{
		HAL_RTCEx_BKUPWrite(&hrtc, RTC_BKP_DR4, data);
	}
}
// --------------------------------------------------------------------------------
uint32_t ReadBackupRegister(uint8_t type)
{
	if(type == COUNTER_PACKET)
	{
		return HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR1);
	}
	if(type == COUNTER_SECOND)
	{
		return HAL_RTCEx_BKUPRead(&hrtc, RTC_BKP_DR4);
	}

}
// --------------------------------------------------------------------------------
void counter(char* buff)
{



}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_RTC_Init();
  MX_I2C1_Init();
  MX_USART1_UART_Init();
  MX_SPI2_Init();
  MX_ADC1_Init();
  /* USER CODE BEGIN 2 */



#if SLEEP_MODE == ON

if (__HAL_PWR_GET_FLAG(PWR_FLAG_SB) != RESET)			// Is device woke up from standby mode ?
{
	__HAL_PWR_CLEAR_FLAG(PWR_FLAG_SB);  				// clear the flag

	HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN1);  		// disable PA0
	HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);			// Deactivate the RTC wakeup

	// If button was presset more than 5 sec, go to settings mode
	if(HAL_GPIO_ReadPin(GPIOA, ACTION_Pin) == 1)
	{
#if UART_LOG == ON
		char buf_uart_tx[50] = {0,};
		sprintf(buf_uart_tx, "Settings mode\n\r");
		HAL_UART_Transmit(&huart1, buf_uart_tx, sizeof(buf_uart_tx), 1000);
#endif

		led_test_blink(10, 800);

		settings_mode();
	}

	  uint32_t period = ReadBackupRegister(COUNTER_SECOND);

	  if(period >= SLEEP_TIME_10_SEC)
	  {
		  char tramsmeet_data_buffer[50] = {0,};
		  char buf_uart_tx[50] = {0,};

#if LED == ON
	  GREEN_LED_ON;
#endif
	  	  get_THP_bme280(tramsmeet_data_buffer); 				// Meassure T, H and P
	  	  meassure_battery_voltage(tramsmeet_data_buffer);  	// Meassure voltage on battery
	  	  read_time_internal_RTC(tramsmeet_data_buffer);

#if UART_LOG == ON
 	  memset(buf_uart_tx, 0, sizeof(buf_uart_tx));
 	  sprintf(buf_uart_tx, "TX data: %s \n\r", tramsmeet_data_buffer);
 	  HAL_UART_Transmit(&huart1, buf_uart_tx, sizeof(buf_uart_tx), 1000);
#endif

